Revit 2024 API
WallPaint.WallpaintColor Property
 The property labeled "Color" from the "WallPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WallpaintColor { get; }
Visual Basic
Public Shared ReadOnly Property WallpaintColor As String
	Get
Visual C++
public:
static property String^ WallpaintColor {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
WallPaint Class
Autodesk.Revit.DB.Visual Namespace